app/controllers/servicos_controller.rb

SELECT * FROM "servicos"
---
  def index
    @servicos = Servico.all

SELECT * FROM "servicos" WHERE ("servicos"."id" = 1)
---
  def show
    @servico = Servico.find(params[:id])

INSERT INTO "servicos" ("tipo", "created_at", "valor_diario", "updated_at", "empreitada", "objeto_da_empreitada", "nome_do_prestador", "valor_total") VALUES(E'Pedreiro', '2009-09-07 14:24:18.848828', 60.0, '2009-09-07 14:24:18.848828', E'Não', E'', E'Seu Jorge', NULL) RETURNING "id"
---
  def create
    @servico = Servico.new(params[:servico])

    respond_to do |format|
      if @servico.save